GitLit/app/controllers/cannabis_controller.rb

    def index
        @cannabi = Cannabis.all
---
SELECT "cannabis".* FROM "cannabis"

    def show
        @cannabi = Cannabis.find(params[:id])
---
SELECT "cannabis".* FROM "cannabis" WHERE "cannabis"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

    def create
        strain = params[:strain]
        classification = params[:classification]
        price = params[:price]
        desc = params[:description]
        new_c = Cannabis.create(strain: strain,
            classification: classification,
            price: price,
            description: desc)
---
INSERT INTO "cannabis" ("strain", "classification", "price", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["strain", "DatLoud"], ["classification", "Indica"], ["price", 15], ["description", "WHAT DID YOU SAY"], ["created_at", "2020-10-30 20:17:36.552181"], ["updated_at", "2020-10-30 20:17:36.552181"]]

    def edit
        @cannabis = Cannabis.find(params[:id])
---
SELECT "cannabis".* FROM "cannabis" WHERE "cannabis"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]

    def update
        @cannabis = Cannabis.find(params[:id])
        @cannabis.update(cannabis_paramaters)
---
SELECT "cannabis".* FROM "cannabis" WHERE "cannabis"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
UPDATE "cannabis" SET "classification" = ?, "price" = ?, "updated_at" = ? WHERE "cannabis"."id" = ?  [["classification", "Hybrid"], ["price", 17], ["updated_at", "2020-10-30 22:39:25.183465"], ["id", 4]]

    def destroy
        @cannabis = Cannabis.find(params[:id])
        @cannabis.destroy
---
SELECT "cannabis".* FROM "cannabis" WHERE "cannabis"."id" = ? LIMIT ?  [["id", 12], ["LIMIT", 1]]
DELETE FROM "cannabis" WHERE "cannabis"."id" = ?  [["id", 12]]